Revit 2024 API
UnitTypeId.SquareMeters Property
 Square meters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId SquareMeters { get; }
Visual Basic
Public Shared ReadOnly Property SquareMeters As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SquareMeters {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace